In [2]:
import numpy as np
import pandas as pd

In [3]:
data={
    'names' : ["Alice", "Bob", "Carol", "David", "Emma"],
    'ages' : [28, 34, 25, 40, 30],
    'salaries' : [75000, 68000, 72000, 90000, 81000],
    'cities' : ["New York", "Los Angeles", "Chicago", "Houston", "San Francisco"]
}
data
print(type(data))

<class 'dict'>

In [4]:
labels=['a','b','c','d','e']

In [5]:
df=pd.DataFrame(data, index=labels)

In [6]:
df['designation']=['doctor','engg','prof','manager','engg'] # this is called asssign the new column to dataframe

In [7]:
df

   names  ages  salaries         cities designation
a  Alice    28     75000       New York      doctor
b    Bob    34     68000    Los Angeles        engg
c  Carol    25     72000        Chicago        prof
d  David    40     90000        Houston     manager
e   Emma    30     81000  San Francisco        engg

In [8]:
df[df['designation'].isin(['doctor','prof','engg'])] # this is compare if some element present, then provide that that row

   names  ages  salaries         cities designation
a  Alice    28     75000       New York      doctor
b    Bob    34     68000    Los Angeles        engg
c  Carol    25     72000        Chicago        prof
e   Emma    30     81000  San Francisco        engg